<template>
  <div>
    <div class="clearfix text-center pb-50 pt-50">
      <button type="button" class="btn btn-primary" @click="downImg('pdf-content')">下载</button>
    </div>
    <div class="pdf-content" id="pdf-content">
      <p><font color="navy" face="仿宋"><strong>编者按：</strong>突如其来的新冠肺炎疫情，是对国家治理体系和治理能力现代化的一次大考。在以习近平同志为核心的党中央坚强领导下，常态化疫情防控和经济社会发展“双统筹”稳步走向“双胜利”，彰显“中国之治”生动实践和显著优势。为进一步深入学习宣传贯彻党的十九届四中全会精神，更好坚持和完善中国特色社会主义制度，推动制度优势更好地转化为治理效能，中央网信办与求是杂志社共同组织“中国稳健前行”网上理论传播专栏，邀请思想理论界专家学者撰写系列理论文章，在求是网陆续推出，敬请关注。</font>
      </p>
      <p><font face="楷体"><strong>内容摘要：</strong>组织力建设是治理能力现代化的重要内容。治理，就是对各种资源的统筹协调和配置管理，这也正是组织力的“硬核”所在。在这次疫情防控中，组织力经受住了考验和挑战。新形势新任务条件下，应对突发事件处于常态化、多发期，由此带来的对组织力的考验和挑战也将经常化。应对突发事件、处理各种危机是现代治理的重要任务，也是组织力建设的重大课题，具有现实紧迫性。</font>
      </p>
      <p>
      </p>

      <p></p>
      <p></p>
      <p>组织就是将物的构成部分组合成整体，是人与人或人与物之间资源配置的活动过程，是管理或治理的一大职能。组织力建设是治理能力现代化的重要内容。</p>
      <p></p>
      <p></p>
      <p></p>
      <p><strong>组织力在这次疫情防控中经受住了考验和挑战</strong></p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        冬末春初的这场新冠肺炎疫情，是新中国成立以来在我国发生的传播速度最快、传染范围最广、防控难度最大的一次重大突发公共卫生事件。突如其来的严重疫情，既是“试金石”又是“磨刀石”，既是“大战”又是“大考”，对党的各级组织和广大党员干部特别是各级领导干部的组织力构成一次重大考验和挑战。实践证明，中国共产党的组织力在这次疫情防控中经受住了考验，发挥出了作用，得到了彰显。突出表现在：</p>
      <p></p>
      <p></p>
      <p>
        一是以习近平同志为核心的党中央集中统一领导，总揽全局、协调各方，统筹兼顾、科学施策，以雷霆万钧之势，打响了这场声势浩大的人民战争、总体战、阻击战，成为疫情防控中扭转形势的定海神针。在党中央统一领导下，党政军民学迅速行动，东西南北中快速集中，形成了排山倒海的磅礴力量。船重千钧，掌舵一人。习近平总书记亲自指挥、亲自部署，运筹帷幄、领航掌舵，展现了高超的政治智慧和卓越的领导力。“沧海横流显砥柱，万山磅礴看主峰。”以习近平同志为核心的党中央所展现出来的领导力、决断力和动员力是强大组织力的集中体现。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        二是基层党组织的战斗堡垒作用和广大党员的先锋模范作用充分彰显。一个组织就是一座堡垒，一名党员就是一面旗帜。9000多万名党员、460多万个基层党组织闻令即动，把疫情当命令、防控当责任，党员突击队、党员先锋岗出现在抗疫战场，临时党支部在救死扶伤的阵地上快速建立，鲜艳的党旗在火线高高飘扬。基层党组织和广大党员的影响力、战斗力与凝聚力是强大组织力的鲜明特征。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        三是强大的组织体系实现了上下贯通、纵横一体，发挥了集中力量办大事和“一方有难、八方支援”的制度优势。在这次抗疫斗争中，各地各级坚持全国一盘棋，从中央到地方层层联防、级级联控，采取网格化管理、地毯式排查；火神山、雷神山医院火速建成；十几所方舱医院迅速大规模改建；全国各地300多支医疗队、4万多名医护人员千里驰援；实施供给保障大调配、实行全国统一管理、统一调拨等等。强大的组织力，使得疫情中能够动员一切可以动员的力量，调动一切可以调动的资源，创造出大团结、大协作的大格局。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>一个国家的治理体系和治理能力在重大灾难和危机中得到检验与考验；一个政党的组织力在重大风险和事件中得到加强与磨炼。</p>
      <p></p>
      <p></p>
      <p></p>
      <p><strong>应对突发事件对组织力建设提出了更高标准和要求</strong></p>
      <p></p>
      <p></p>
      <p></p>
      <p>在这次新冠肺炎疫情防控中，组织力发挥了重要作用，但还有不少提升空间。特别是，新形势新任务条件下，应对突发事件处于常态化、多发期，由此带来的对组织力的挑战和考验也将经常化。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        这是由突发事件的特点和属性来决定的。突发事件是指突然发生，造成或者可能造成严重社会危害，需要采取应急处置措施予以应对的自然灾害、事故灾难、公共卫生事件和社会安全事件。突发事件具有以下几个突出特点：一是突发性。突发事件最基本的特征是突如其来、始料不及甚至意想不到，它常常在人们毫无准备的情况下不期而遇，可谓从天而降。俗话说：“天有不测风云，人有旦夕祸福。”说的就是突发性。二是复杂性。突发事件往往是各种矛盾和问题交织并相互作用的结果，但它所呈现出来的形态和方式又是多种多样，而且复杂多变，最基本的形态是自然灾害、事故灾难、公共卫生事件和社会安全事件等四类。三是传导性。在互联网时代，突发事件好比病毒，传染性强、传播力快，有时都不需要发酵便爆炸开来，而且借助互联网呈几何级发展，产生各种各样的连锁反应，出现轰动效应和辐射效应。四是破坏性。突发事件是严重“危险品”，一旦发生并且处置不当不及时，则危害性大、杀伤力强，有时是大面积、大范围和爆炸式的影响。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        这是由组织力的功能和作用来决定的。1938年，毛泽东同志在《论持久战》中就明确提出了组织力，并强调政治组织力是决定中日两国战争胜负的重要因素。在革命、建设和改革各个历史时期，我们党始终高度重视组织力建设。组织力的功能和作用集中体现在“四力”上，即政治领导力、思想引领力、群众组织力和社会号召力。组织力在应对突发事件中扮演重要角色，发挥特殊作用。在应对突发事件中，组织力是枢纽和开关，而且既是指挥中心，又是战斗堡垒。特别是，它能依托科学严密的组织体系优势，积极宣传群众、教育群众、组织群众和动员群众，具有不可比拟和不可或缺的作用。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        这是由组织力的短板和弱项来决定的。从一定意义上讲，组织力强弱与否既取决于是否发挥出优势，更取决于是否及时补上短板。一是决断力的迟滞则可能造成应对被动。决断力是组织力的基础环节，任何对突发事件信号的轻描淡写，或不以为然，或漫不经心，都会带来决断迟缓、拖延，以致错失良机，可能浪费处置突发事件的“窗口期”，落个当断不断反遭其乱的结局。二是执行力的梗阻则可能造成应对打折。落实就是执行，倘若落实不力，再好的决断力也失去意义。从现实看，如何做到落细落小落具体、抓紧抓实抓到位，以钉钉子精神和绣花功夫让落实真正落地，防止种种伪落实、软落实甚至假落实，才不会出现“在一片落实声中落空”的现象。三是凝聚力的脆弱则可能造成应对空泛。突发事件出现时，凭什么让大家步调一致、同行同向，靠什么使大家心往一处想、劲往一处使，万众一心、众志成城？凭得是凝聚力、感召力。而凝聚力、感召力的形成，靠得是正确的政策措施和优良的作风，任何官僚主义形式主义的东西都是对凝聚力的无情侵蚀。</p>
      <p></p>
      <p></p>
      <p></p>
      <p><strong>发挥组织力在应对突发事件中的重大作用</strong></p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        把应对突发事件作为组织力建设重大课题，具有现实紧迫性。新形势新任务条件下，各种矛盾和问题集中地叠加式地出现，各种挑战和考验异常严峻。从大的国际环境看，我们正处于“百年未有之大变局”中，斗争的现实一点也不省心；从具体的国内局势看，各种艰苦卓绝的攻坚战接踵而至，改革、发展和稳定的任务一点也不轻松，中华民族伟大复兴的中国梦的确不是敲锣打鼓就能实现的。在这种严峻形势下，对有可能随时出现的突发事件和各种形态的危机得有充分准备，注重风险防范化解，从“最坏处”准备、向“最好处”努力。这次疫情防控是一次难得的组织力“练兵”，实践证明是合格的，交了一份党和人民满意的答卷，然而不能满足、不可骄傲，更不应懈怠。组织力建设有许多事要做，包括自身体系的健全完善等，但通过这次疫情防控得到的一个重要启示和认知是，把应对突发事件作为组织力建设的重大课题，具有现实紧迫性。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        强化组织力在应对突发事件中的作用。规律告诉我们，应对突发事件切忌慌乱无章、杂乱无序、忙乱无效，讲究有力有序有效地展开应对。实现这“三有”，离不开组织力的强大作用。作为组织力重要内容的政治领导力、思想引领力、群众组织力、社会号召力，如何保证并实现？应当具体体现在以下四个方面作用上：一是组织发动作用。突发事件发生了，迅速把各方面力量集中、发动并组织起来，包括思想上的发动、人员上的组织，这是基础环节。二是统筹协调作用。“统”得起、“分”得下，让方方面面的资源最优化、最大化，并且集中到一个目标上来、统一到问题解决上来。三是宣传教育作用。针对突发事件发生后民众心理变化，跟踪社会舆情动态，及时把政策宣传和思想教育贯穿于应对突发事件的全过程，以保持社会稳定和人心安定。四是战斗堡垒和先锋模范作用。9000多万名党员和460多万个基层党组织是世界上任何一个政党都无法比拟的优势，他们分布在各行各业、各个领域和各个层级，把他们的先进性发挥出来，任何矛盾和问题都可以解决。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        掌握好应对突发事件的“优先级”。突发事件发生后，如何在“黄金时间”里把它控制住并解决好，得考虑先解决什么、后解决什么，分清楚轻重缓急、主次大小，也就是掌握好它的“优先级”。一是“先标后本”。把暴露出来的或浮于面上的“引线”给“剪”掉、“拆”了，先治标，然后为治本赢得时间。二是“先官后民”。党员干部特别是领导干部，应该守土有责、守土尽责，出了问题先问责他们，这是天经地义、理所当然的事情，不能不管青红皂白先拿群众说事。三是“先果后因”。事情的发生有“前因后果”，但处理事情得“先果后因”，总结经验教训是事情处理好了之后的事。四是“先诛后教”。出事了，先处理当事人，再教育更多人，以案例说事、用典型说话，这样的教育更有说服力。五是“先礼后兵”。应对突发事件要防止一上来就“动武”，强制性措施容易激化矛盾，应对突发事件最好的“武器”是法律，依法应对是最有效的方法和手段。</p>
      <p><font color="navy" face="仿宋"><strong>编者按：</strong>突如其来的新冠肺炎疫情，是对国家治理体系和治理能力现代化的一次大考。在以习近平同志为核心的党中央坚强领导下，常态化疫情防控和经济社会发展“双统筹”稳步走向“双胜利”，彰显“中国之治”生动实践和显著优势。为进一步深入学习宣传贯彻党的十九届四中全会精神，更好坚持和完善中国特色社会主义制度，推动制度优势更好地转化为治理效能，中央网信办与求是杂志社共同组织“中国稳健前行”网上理论传播专栏，邀请思想理论界专家学者撰写系列理论文章，在求是网陆续推出，敬请关注。</font>
      </p>
      <p><font face="楷体"><strong>内容摘要：</strong>组织力建设是治理能力现代化的重要内容。治理，就是对各种资源的统筹协调和配置管理，这也正是组织力的“硬核”所在。在这次疫情防控中，组织力经受住了考验和挑战。新形势新任务条件下，应对突发事件处于常态化、多发期，由此带来的对组织力的考验和挑战也将经常化。应对突发事件、处理各种危机是现代治理的重要任务，也是组织力建设的重大课题，具有现实紧迫性。</font>
      </p>
      <p></p>
      <p></p>
      <p></p>
      <p></p>
      <p>组织就是将物的构成部分组合成整体，是人与人或人与物之间资源配置的活动过程，是管理或治理的一大职能。组织力建设是治理能力现代化的重要内容。</p>
      <p></p>
      <p></p>
      <p></p>
      <p><strong>组织力在这次疫情防控中经受住了考验和挑战</strong></p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        冬末春初的这场新冠肺炎疫情，是新中国成立以来在我国发生的传播速度最快、传染范围最广、防控难度最大的一次重大突发公共卫生事件。突如其来的严重疫情，既是“试金石”又是“磨刀石”，既是“大战”又是“大考”，对党的各级组织和广大党员干部特别是各级领导干部的组织力构成一次重大考验和挑战。实践证明，中国共产党的组织力在这次疫情防控中经受住了考验，发挥出了作用，得到了彰显。突出表现在：</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        一是以习近平同志为核心的党中央集中统一领导，总揽全局、协调各方，统筹兼顾、科学施策，以雷霆万钧之势，打响了这场声势浩大的人民战争、总体战、阻击战，成为疫情防控中扭转形势的定海神针。在党中央统一领导下，党政军民学迅速行动，东西南北中快速集中，形成了排山倒海的磅礴力量。船重千钧，掌舵一人。习近平总书记亲自指挥、亲自部署，运筹帷幄、领航掌舵，展现了高超的政治智慧和卓越的领导力。“沧海横流显砥柱，万山磅礴看主峰。”以习近平同志为核心的党中央所展现出来的领导力、决断力和动员力是强大组织力的集中体现。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        二是基层党组织的战斗堡垒作用和广大党员的先锋模范作用充分彰显。一个组织就是一座堡垒，一名党员就是一面旗帜。9000多万名党员、460多万个基层党组织闻令即动，把疫情当命令、防控当责任，党员突击队、党员先锋岗出现在抗疫战场，临时党支部在救死扶伤的阵地上快速建立，鲜艳的党旗在火线高高飘扬。基层党组织和广大党员的影响力、战斗力与凝聚力是强大组织力的鲜明特征。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        三是强大的组织体系实现了上下贯通、纵横一体，发挥了集中力量办大事和“一方有难、八方支援”的制度优势。在这次抗疫斗争中，各地各级坚持全国一盘棋，从中央到地方层层联防、级级联控，采取网格化管理、地毯式排查；火神山、雷神山医院火速建成；十几所方舱医院迅速大规模改建；全国各地300多支医疗队、4万多名医护人员千里驰援；实施供给保障大调配、实行全国统一管理、统一调拨等等。强大的组织力，使得疫情中能够动员一切可以动员的力量，调动一切可以调动的资源，创造出大团结、大协作的大格局。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>一个国家的治理体系和治理能力在重大灾难和危机中得到检验与考验；一个政党的组织力在重大风险和事件中得到加强与磨炼。</p>
      <p></p>
      <p></p>
      <p></p>
      <p><strong>应对突发事件对组织力建设提出了更高标准和要求</strong></p>
      <p></p>
      <p></p>
      <p></p>
      <p>在这次新冠肺炎疫情防控中，组织力发挥了重要作用，但还有不少提升空间。特别是，新形势新任务条件下，应对突发事件处于常态化、多发期，由此带来的对组织力的挑战和考验也将经常化。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        这是由突发事件的特点和属性来决定的。突发事件是指突然发生，造成或者可能造成严重社会危害，需要采取应急处置措施予以应对的自然灾害、事故灾难、公共卫生事件和社会安全事件。突发事件具有以下几个突出特点：一是突发性。突发事件最基本的特征是突如其来、始料不及甚至意想不到，它常常在人们毫无准备的情况下不期而遇，可谓从天而降。俗话说：“天有不测风云，人有旦夕祸福。”说的就是突发性。二是复杂性。突发事件往往是各种矛盾和问题交织并相互作用的结果，但它所呈现出来的形态和方式又是多种多样，而且复杂多变，最基本的形态是自然灾害、事故灾难、公共卫生事件和社会安全事件等四类。三是传导性。在互联网时代，突发事件好比病毒，传染性强、传播力快，有时都不需要发酵便爆炸开来，而且借助互联网呈几何级发展，产生各种各样的连锁反应，出现轰动效应和辐射效应。四是破坏性。突发事件是严重“危险品”，一旦发生并且处置不当不及时，则危害性大、杀伤力强，有时是大面积、大范围和爆炸式的影响。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        这是由组织力的功能和作用来决定的。1938年，毛泽东同志在《论持久战》中就明确提出了组织力，并强调政治组织力是决定中日两国战争胜负的重要因素。在革命、建设和改革各个历史时期，我们党始终高度重视组织力建设。组织力的功能和作用集中体现在“四力”上，即政治领导力、思想引领力、群众组织力和社会号召力。组织力在应对突发事件中扮演重要角色，发挥特殊作用。在应对突发事件中，组织力是枢纽和开关，而且既是指挥中心，又是战斗堡垒。特别是，它能依托科学严密的组织体系优势，积极宣传群众、教育群众、组织群众和动员群众，具有不可比拟和不可或缺的作用。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        这是由组织力的短板和弱项来决定的。从一定意义上讲，组织力强弱与否既取决于是否发挥出优势，更取决于是否及时补上短板。一是决断力的迟滞则可能造成应对被动。决断力是组织力的基础环节，任何对突发事件信号的轻描淡写，或不以为然，或漫不经心，都会带来决断迟缓、拖延，以致错失良机，可能浪费处置突发事件的“窗口期”，落个当断不断反遭其乱的结局。二是执行力的梗阻则可能造成应对打折。落实就是执行，倘若落实不力，再好的决断力也失去意义。从现实看，如何做到落细落小落具体、抓紧抓实抓到位，以钉钉子精神和绣花功夫让落实真正落地，防止种种伪落实、软落实甚至假落实，才不会出现“在一片落实声中落空”的现象。三是凝聚力的脆弱则可能造成应对空泛。突发事件出现时，凭什么让大家步调一致、同行同向，靠什么使大家心往一处想、劲往一处使，万众一心、众志成城？凭得是凝聚力、感召力。而凝聚力、感召力的形成，靠得是正确的政策措施和优良的作风，任何官僚主义形式主义的东西都是对凝聚力的无情侵蚀。</p>
      <p></p>
      <p></p>
      <p></p>
      <p><strong>发挥组织力在应对突发事件中的重大作用</strong></p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        把应对突发事件作为组织力建设重大课题，具有现实紧迫性。新形势新任务条件下，各种矛盾和问题集中地叠加式地出现，各种挑战和考验异常严峻。从大的国际环境看，我们正处于“百年未有之大变局”中，斗争的现实一点也不省心；从具体的国内局势看，各种艰苦卓绝的攻坚战接踵而至，改革、发展和稳定的任务一点也不轻松，中华民族伟大复兴的中国梦的确不是敲锣打鼓就能实现的。在这种严峻形势下，对有可能随时出现的突发事件和各种形态的危机得有充分准备，注重风险防范化解，从“最坏处”准备、向“最好处”努力。这次疫情防控是一次难得的组织力“练兵”，实践证明是合格的，交了一份党和人民满意的答卷，然而不能满足、不可骄傲，更不应懈怠。组织力建设有许多事要做，包括自身体系的健全完善等，但通过这次疫情防控得到的一个重要启示和认知是，把应对突发事件作为组织力建设的重大课题，具有现实紧迫性。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        强化组织力在应对突发事件中的作用。规律告诉我们，应对突发事件切忌慌乱无章、杂乱无序、忙乱无效，讲究有力有序有效地展开应对。实现这“三有”，离不开组织力的强大作用。作为组织力重要内容的政治领导力、思想引领力、群众组织力、社会号召力，如何保证并实现？应当具体体现在以下四个方面作用上：一是组织发动作用。突发事件发生了，迅速把各方面力量集中、发动并组织起来，包括思想上的发动、人员上的组织，这是基础环节。二是统筹协调作用。“统”得起、“分”得下，让方方面面的资源最优化、最大化，并且集中到一个目标上来、统一到问题解决上来。三是宣传教育作用。针对突发事件发生后民众心理变化，跟踪社会舆情动态，及时把政策宣传和思想教育贯穿于应对突发事件的全过程，以保持社会稳定和人心安定。四是战斗堡垒和先锋模范作用。9000多万名党员和460多万个基层党组织是世界上任何一个政党都无法比拟的优势，他们分布在各行各业、各个领域和各个层级，把他们的先进性发挥出来，任何矛盾和问题都可以解决。</p>
      <p></p>
      <p></p>
      <p></p>
      <p>
        掌握好应对突发事件的“优先级”。突发事件发生后，如何在“黄金时间”里把它控制住并解决好，得考虑先解决什么、后解决什么，分清楚轻重缓急、主次大小，也就是掌握好它的“优先级”。一是“先标后本”。把暴露出来的或浮于面上的“引线”给“剪”掉、“拆”了，先治标，然后为治本赢得时间。二是“先官后民”。党员干部特别是领导干部，应该守土有责、守土尽责，出了问题先问责他们，这是天经地义、理所当然的事情，不能不管青红皂白先拿群众说事。三是“先果后因”。事情的发生有“前因后果”，但处理事情得“先果后因”，总结经验教训是事情处理好了之后的事。四是“先诛后教”。出事了，先处理当事人，再教育更多人，以案例说事、用典型说话，这样的教育更有说服力。五是“先礼后兵”。应对突发事件要防止一上来就“动武”，强制性措施容易激化矛盾，应对突发事件最好的“武器”是法律，依法应对是最有效的方法和手段。</p>
    </div>
  </div>
</template>

<script>
import * as _ from 'lodash'
import { getUrlBase64 } from '@~/js/utils'
import html2Canvas from 'html2canvas'
import JsPDF from 'jspdf'

export default {
  name: 'DownloadPdf',
  data () {
    return {
      offsetLeft: 0,
      offsetTop: 0,
      imgData: []
    }
  },
  mounted () {
    let self = this
    self.$nextTick(() => {
    })
  },
  methods: {
    downImg (id) {
      let self = this
      let imgUrl = []
      let maxWidth = 820
      let maxHeight = 1160
      let imgArr = document.all(id).getElementsByTagName('img')
      const $this = $('.pdf-content')
      let contentHeight = $this.outerHeight(true)
      let pageSize = Math.ceil(contentHeight / 1160)
      pageSize = Math.ceil((contentHeight + 100 * pageSize) / 1160)
      self.offsetTop = $this.offset().top
      self.offsetLeft = $this.offset().left
      $this.css({
        width: maxWidth * pageSize,
        height: maxHeight,
        'column-count': pageSize
      })
      // 图片转base64
      for (let i = 0; i < imgArr.length; i++) {
        imgUrl.push(imgArr[i].getAttribute('src'))
        getUrlBase64(imgArr[i].getAttribute('src'), '', '', function (base) {
          imgArr[i].setAttribute('src', base)
        })
      }
      const scale = 2
      // 开始转换图片
      html2Canvas(document.querySelector('#' + id), {
        allowTaint: true,
        scale: scale,
        taintTest: false,
        dpi: window.devicePixelRatio,
        x: self.offsetLeft,
        y: self.offsetTop,
        width: maxWidth * pageSize,
        height: maxHeight
      }).then(function (canvas) {
        let contentWidth = canvas.width
        let contentHeight = canvas.height
        let position = 50
        // a4纸的尺寸[595.28,841.89]，html页面生成的canvas在pdf中图片的宽高
        // 留边50px[515,762]
        let imgWidth = contentWidth * 762 / contentHeight
        let imgHeight = 762
        let leftWidth = contentWidth / scale
        let pageData = canvas.toDataURL('image/jpeg', 1.0)
        let PDF = new JsPDF('', 'pt', 'a4')
        /* let img = new Image()
        img.src = pageData
        document.body.append(img) */
        if (leftWidth <= maxWidth) {
          PDF.addImage(pageData, 'JPEG', position, 40, imgWidth, imgHeight)
        } else {
          while (leftWidth > 0) {
            PDF.addImage(pageData, 'JPEG', position, 40, imgWidth, imgHeight)
            leftWidth -= maxWidth
            position -= 515 + 40
            if (leftWidth > 0) {
              PDF.addPage()
            }
          }
        }
        document.querySelector('#' + id).removeAttribute('style')
        PDF.save('1212.pdf')
      })
      // 还原图片地址
      _.delay(() => {
        for (let i = 0; i < imgArr.length; i++) {
          imgArr[i].setAttribute('src', imgUrl[i])
        }
      }, 5000)
    }
  }
}
</script>

<style scoped lang="less">
.pdf-content {
  width: 820px;
  column-gap: 100px;
  column-fill: auto;
}
</style>
